app/views/posts/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."post_id" = ?  [["post_id", 3]]
---
        <h2 class="heading10" data-en="ITEMS"><span>使用アイテム一覧</span></h2>
        <% @post.items.each do |item| %>