app/controllers/items_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @item = Item.new
    @post = Post.find(params[:post_id])

INSERT INTO "items" ("post_id", "products_name", "brand", "size", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["post_id", 2], ["products_name", "item1"], ["brand", "itembrand"], ["size", "size"], ["price", 1000], ["created_at", "2021-10-24 03:29:25.810367"], ["updated_at", "2021-10-24 03:29:25.810367"]]
SELECT "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create
      @item = Item.new(item_params)
      if @item.save
        last_item = Item.last()