app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])
    @user = User.find(@post.user_id)

INSERT INTO "posts" ("user_id", "description", "image_title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["description", "aaaa"], ["image_title", "aaa"], ["created_at", "2021-10-24 02:34:34.651834"], ["updated_at", "2021-10-24 02:34:34.651834"]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create
      @post = Post.new(post_params)
      if @post.save
        last_id = Post.last(1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "image_title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "cccc"], ["image_title", "ccc"], ["updated_at", "2021-10-24 03:44:22.625887"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    if
      @post.update(post_params)