app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "name" = ? WHERE "users"."id" = ?  [["updated_at", "2021-10-24 12:13:27.628839"], ["name", "user_name"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)